pmo-dataset/graphviz/27.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Issue occurs" -> "Inform employer";
  "Death or serious\ninjury?" -> "ExclusiveGateway_2" [label="No"];
  "Death or serious\ninjury?" -> "Inform relatives" [label="Yes"];
  "Notify labor\ninspectorate" -> "ExclusiveGateway_1";
  "Safety authorities\ninformed?" -> "Notify labor\ninspectorate" [label="No"];
  "Safety authorities\ninformed?" -> "ExclusiveGateway_1" [label="Yes"];
  "ParallelGateway_1" -> "Person insured?";
  "Notify insurance" -> "ExclusiveGateway_3";
  "ParallelGateway_1" -> "Safety authorities\ninformed?";
  "ExclusiveGateway_1" -> "ParallelGateway_2";
  "ExclusiveGateway_3" -> "ParallelGateway_2";
  "Person insured?" -> "Notify insurance" [label="Yes"];
  "Inform employer" -> "Type of event?";
  "ExclusiveGateway_4" -> "Issue resolved";
  "ExclusiveGateway_2" -> "ExclusiveGateway_4";
  "ParallelGateway_2" -> "Is the person dead?\n(Death as a result\nof an accident)";
  "ExclusiveGateway_5" -> "ExclusiveGateway_2";
  "Is the person dead?\n(Death as a result\nof an accident)" -> "ExclusiveGateway_5" [label="Yes"];
  "Stay informed about\nthe person's\ncondition" -> "Did the person die\nand was insured?";
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "Notify insurance\nabout the death" -> "ExclusiveGateway_6";
  "Did the person die\nand was insured?" -> "Notify insurance\nabout the death" [label="Yes"];
  "Schedule safety\ntraining" -> "ExclusiveGateway_7";
  "Employee training\nreqired?" -> "ExclusiveGateway_7" [label="No"];
  "Employee training\nreqired?" -> "Schedule safety\ntraining" [label="Yes"];
  "Type of event?" -> "Death or serious\ninjury?" [label="Event that almost\nled to an accident"];
  "ExclusiveGateway_7" -> "ExclusiveGateway_4";
  "Run diagnostics/find\nproblems" -> "ExclusiveGateway_8";
  "ExclusiveGateway_8" -> "Fix the problem";
  "Fix the problem" -> "More issues?_1";
  "More issues?_1" -> "ExclusiveGateway_4" [label="No"];
  "More issues?_1" -> "ExclusiveGateway_8" [label="Yes"];
  "ExclusiveGateway_9" -> "Fix the threat";
  "Fix the threat" -> "More issues?_2";
  "More issues?_2" -> "ExclusiveGateway_9" [label="Yes"];
  "Identify potential\nissues" -> "ExclusiveGateway_9";
  "Is the person dead?\n(Death as a result\nof an accident)" -> "Stay informed about\nthe person's\ncondition" [label="No"];
  "Type of event?" -> "Employee training\nreqired?" [label="Defect in protective\nsystem"];
  "Person insured?" -> "ExclusiveGateway_3" [label="No"];
  "Type of event?" -> "Run diagnostics/find\nproblems" [label="Accident at work"];
  "Type of event?" -> "Identify potential\nissues" [label="Serious/imminent\nthreat to safety"];
  "Inform relatives" -> "ParallelGateway_1";
  "More issues?_2" -> "ExclusiveGateway_4";
  "Did the person die\nand was insured?" -> "ExclusiveGateway_6" [label="No"];

  "Issue occurs" [shape=circle];
  "Issue resolved" [shape=circle, penwidth=4];
  "Type of event?" [shape=diamond];
  "Death or serious\ninjury?" [shape=diamond];
  "Safety authorities\ninformed?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "Person insured?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Is the person dead?\n(Death as a result\nof an accident)" [shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "Did the person die\nand was insured?" [shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "Employee training\nreqired?" [shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "More issues?_1" [label="More issues?", shape=diamond];
  "ExclusiveGateway_9" [label="X", shape=diamond];
  "More issues?_2" [label="More issues?", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
